In [9]:
import pandas as pd
import matplotlib as plt

In [10]:
titanic=pd.read_csv("titanic.csv")

In [11]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
titanic.shape

(891, 12)

In [13]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [14]:
titanic.drop(["PassengerId","Name","Ticket","Cabin","Embarked","SibSp","Parch"],axis='columns',inplace=True)

In [15]:
titanic.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [20]:
titanic.Sex=titanic.Sex.map({"male":1,"female":0})

In [21]:
titanic.head()

   Survived  Pclass  Sex   Age     Fare
0         0       3    1  22.0   7.2500
1         1       1    0  38.0  71.2833
2         1       3    0  26.0   7.9250
3         1       1    0  35.0  53.1000
4         0       3    1  35.0   8.0500

In [22]:
titanic.corr()

          Survived    Pclass       Sex       Age      Fare
Survived  1.000000 -0.338481 -0.543351 -0.077221  0.257307
Pclass   -0.338481  1.000000  0.131900 -0.369226 -0.549500
Sex      -0.543351  0.131900  1.000000  0.093254 -0.182333
Age      -0.077221 -0.369226  0.093254  1.000000  0.096067
Fare      0.257307 -0.549500 -0.182333  0.096067  1.000000

In [24]:
inputs=titanic.drop(["Survived"],axis="columns")

In [25]:
target=titanic.Survived

In [27]:
titanic.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [33]:
inputs.isna().sum()

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [34]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())

In [36]:
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [31]:
from sklearn.model_selection import train_test_split

In [37]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [38]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [40]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [41]:
model.score(X_test,y_test)

0.7988826815642458

In [45]:
model.predict([[3,1,45,8.0500]])

array([1], dtype=int64)

# Here 1 means survived and 0 means not survived